# Pandas užduotys 3

In [25]:
import numpy as np
import pandas as pd
from xlsxwriter import Workbook
from sqlalchemy import create_engine

# 1 Ištraukite lentelę iš [šios](https://work.studentnews.eu/s/3695/75547-European-countries-the-table-language-population-capital-currency-phone-code-internet-code.htm) svetainės. Išsaugokite kintamąjame.

In [18]:
html = pd.read_html('https://work.studentnews.eu/s/3695/75547-European-countries-the-table-language-population-capital-currency-phone-code-internet-code.htm')

In [19]:
html[1].head()

,Staat,Official languages,Population,Capital,Currency,Phone,Int.
0,Austria,German,8.4 million,Vienna,euro (EUR),43,.at
1,Belgium,"Dutch (north), French (south), German",11 million,Brussels,euro (EUR),32,.be
2,Bulgaria,Bulgarian,7 million,Sofia,Bulgarian lev (BGN),359,.bg
3,Croatia,Croatian,4.3 million,Zagreb,Croatian kuna (HRK),385,.hr
4,Cyprus,"Greek, Turkish",800 000,Nicosia,euro (EUR),357,.cy

In [20]:
countries=html[1]

# 2 šių duomenų pagrindu sukurkite CSV, Excelio failus, ir SQLite3 duomenų bazę. Patikrinkite, ar suveikė.

In [21]:
excel_writer = pd.ExcelWriter('countries.xlsx', engine='xlsxwriter')
countries.to_excel(excel_writer, sheet_name='Sheet1')

In [26]:
countries.to_csv('countries.csv', index=False)
engine= create_engine('sqlite:///countries.db')
countries.to_sql('counties', con=engine, index=False)

32

# 3 Nuskaitykite į DF šį [failą](https://github.com/robotautas/kursas/blob/master/Pandas/top_20_CA_wildfires.csv)

In [65]:
fires=pd.read_csv('top_20_CA_wildfires.csv')

In [66]:
fires.head()

,fire_name,cause,month,year,county,acres,structures,deaths
0,Mendocino Complex,Under Investigation,July,2018,"Colusa County, Lake County, Mendocino County &...",459123,280,1
1,Thomas,Powerlines,December,2017,Ventura & Santa Barbara,281893,1063,2
2,Cedar,Human Related,October,2003,San Diego,273246,2820,15
3,Rush,Lightning,August,2012,Lassen,271911,0,0
4,Rim,Human Related,August,2013,Tuolumne,257314,112,0

# 4 Kiek unikalių reikšmių yra stulpelyje 'cause'?

In [67]:
len(fires['cause'].unique())

5

# 5 Kokios gaisrų priežastys, kiek kartų pasitaiko lentelėje?

In [68]:
fires['cause'].value_counts()

cause
Human Related          7
Lightning              7
Powerlines             4
Under Investigation    1
Undetermined           1
Name: count, dtype: int64

# 6 Kuriais metais buvo daugiausia gaisrų?

In [69]:
fires['year'].value_counts().idxmax()

2018

In [70]:
fires['year'].value_counts()

year
2018    3
2007    2
2008    2
2017    1
2003    1
2012    1
2013    1
1932    1
1977    1
1970    1
2006    1
2009    1
2015    1
2002    1
1987    1
1999    1
Name: count, dtype: int64

# 7 Kiek buvo tokių gaisrų, kuriuose žuvo žmonės?

In [71]:
fires['deaths'].value_counts().drop(0).sum()

10

In [72]:
fires['deaths'].value_counts().drop(0)

deaths
2     4
1     2
15    1
8     1
5     1
85    1
Name: count, dtype: int64

# 8 Surūšiuokite eilutes pagal metus. Išsiaiškinkite, kaip rūšiuoti, kad naujausi gaisrai būtų viršuje

In [73]:
fires.sort_values('year', ascending=False).head()

,fire_name,cause,month,year,county,acres,structures,deaths
0,Mendocino Complex,Under Investigation,July,2018,"Colusa County, Lake County, Mendocino County &...",459123,280,1
15,Camp Fire,Powerlines,November,2018,Butte,153336,18804,85
6,Carr,Human Related,July,2018,"Shasta County,Trinity County",229651,1614,8
1,Thomas,Powerlines,December,2017,Ventura & Santa Barbara,281893,1063,2
16,Rough,Lightning,July,2015,Fresno,151623,4,0

# 9 Parašykite funkciją, kuri mėnesio pavadinimą verstų skaičiumi. Naudodami .apply() lentelėje pakeiskite mėnesių pavadinimus skaičiais. 
*nusikopijuokite žodyną, kad nereikėtų rašyti ranka :)*

In [74]:
def month_to_num(month):
    months = {'January': 1,
              'February': 2,
              'March': 3,
              'April': 4,
              'May': 5, 
              'June': 6,
              'July': 7, 
              'August': 8,
              'September': 9,
              'October': 10,
              'November': 11, 
              'December': 12}
    return months[month]

In [75]:
month_to_num('July')

7

In [76]:
fires['month'] = fires['month'].apply(month_to_num)

In [77]:
fires.head()

,fire_name,cause,month,year,county,acres,structures,deaths
0,Mendocino Complex,Under Investigation,7,2018,"Colusa County, Lake County, Mendocino County &...",459123,280,1
1,Thomas,Powerlines,12,2017,Ventura & Santa Barbara,281893,1063,2
2,Cedar,Human Related,10,2003,San Diego,273246,2820,15
3,Rush,Lightning,8,2012,Lassen,271911,0,0
4,Rim,Human Related,8,2013,Tuolumne,257314,112,0

# 10 Nuskaitykite lentelę iš [čia](https://lt.wikipedia.org/wiki/S%C4%85ra%C5%A1as:Lietuvos_miestai_pagal_gyventojus).

* **Pakeiskite indeksą į stulpelį 'Miestas'**
* **Sutvarkykite duomenis taip, kad gyventojų sk. reprezentuotų lengelis su 'int' reikšme: -
Ten kur trūksta duomenų - nulis. 
ten, kur reikšmės ne integer, sutvarkykite, kad būtų integer.**

In [78]:
duomenys=pd.read_html('https://lt.wikipedia.org/wiki/S%C4%85ra%C5%A1as:Lietuvos_miestai_pagal_gyventojus')

In [80]:
len(duomenys)

5

In [82]:
miestai = duomenys[0]
miestai.head()

,Eilė,Miestas,2021 m.,2011 m.,2001 m.,1989 m.,1979 m.,1970 m.,1959 m.,1923 m.,1897 m.,Tankumas (2019)
0,1,Vilnius,546155,524406,542287,576747,475825,372100.0,236078.0,167400,154532*,1374 žm./km²
1,2,Kaunas,298753,315993,378943,418087,368649,305116.0,219287.0,92446,70920*,1843 žm./km²
2,3,Klaipėda,152008,162360,192954,202929,176648,140012.0,90521.0,35845,20100,1356 žm./km²
3,4,Šiauliai,100653,109328,133883,145629,118724,93057.0,59722.0,21387,16128*,1251 žm./km²
4,5,Panevėžys,89110,99690,119749,126483,102303,73328.0,41096.0,19197,12968*,1590 žm./km²

In [83]:
miestai.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 103 entries, 0 to 102
Data columns (total 12 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Eilė             103 non-null    int64
 1   Miestas          103 non-null    object
 2   2021 m.          103 non-null    int64
 3   2011 m.          103 non-null    int64
 4   2001 m.          103 non-null    int64
 5   1989 m.          103 non-null    int64
 6   1979 m.          103 non-null    int64
 7   1970 m.          102 non-null    float64
 8   1959 m.          101 non-null    float64
 9   1923 m.          96 non-null     object
 10  1897 m.          94 non-null     object
 11  Tankumas (2019)  103 non-null    object
dtypes: float64(2), int64(6), object(4)
memory usage: 9.8+ KB

In [84]:
miestai.set_index('Miestas', inplace=True)

In [86]:
col_list = miestai.columns.tolist()
col_list

['Eilė',
 '2021\xa0m.',
 '2011\xa0m.',
 '2001\xa0m.',
 '1989\xa0m.',
 '1979\xa0m.',
 '1970\xa0m.',
 '1959\xa0m.',
 '1923\xa0m.',
 '1897\xa0m.',
 'Tankumas (2019)']

In [ ]:
#pabaigoje, miestai.info() turėtų rodyti tokį rezultatą

<class 'pandas.core.frame.DataFrame'>
Index: 103 entries, Vilnius to Panemunė
Data columns (total 9 columns):
2019    103 non-null int64
2011    103 non-null int64
2001    103 non-null int64
1989    103 non-null int64
1979    103 non-null int64
1970    103 non-null int64
1959    103 non-null int64
1923    103 non-null int64
1897    103 non-null int64
dtypes: int64(9)
memory usage: 13.0+ KB